label chapter_9:
    $ location("Набережная Бьеншан 8")

    define h9 = CharacterAt(hero, (1040 , 440), "left_tall")
    define h9_long = CharacterAt(hero, (430 , 740), "top_left_big")
    define h9_idea = CharacterAt(hero, (740, 140), "top_left_th")
    define vv = CharacterAt(vivi, (1235, 440), "right_tall")
    define n = CharacterAt(nelly, (1235, 440), "right_tall")
    define vv_long = CharacterAt(vivi, (1235, 140), "top_right_big")
    define driver9 = CharacterAt(hero, (0.5 , 0.5), "left_tall", name = "Водитель")

    scene black
    with dissolve

    show bg doll:
        zoom 0.5
    show vv:
        zoom 0.2
        xpos 1200 ypos 0.3
    with Dissolve(2)

    pause 1.0

    if not doll_broken:
        jump chapter_9s1

    vv "Не волнуйся, солнышко. Курьер уже в пути."
    vv "Скоро ты увидишь свою куклу."

    n "Мама, я устала ждать курьера. Где же он?"

    pause 1.0

    vv "Вот он! Ты видишь, Нэлли?"

    n "Но мама, это же девочка!"

    vv "Ну да. Девочки тоже могут быть курьерами, солнышко."

    n "Мама, я хочу стать курьером, когда вырасту!"

    vv "Ха-ха. Почему, солнышко?"

    n "Курьеры приносят людям то, что они очень хотят!"
    n "Я тоже так хочу."

    vv "Хорошо. Но сначала тебе нужно выздороветь."
    vv_long "Как раз этот курьер должен принести тебе специальную куклу, в которой есть лекарства из той аптеки."

    n "Я помню ту госпожу из аптеки. Она такая страшная.."

    vv "Нэлли, что за манеры! Нехорошо так говорить о других взрослых."
    pause 1.0



    show gg_def:
        zoom 0.2
        xpos 60 ypos 360
    with moveinleft

    h9 "Добрый день!"
    h9 "У меня посылка для маленькой Нелли."

    vv "Мы вас давно ждём! Что заставило вас задержаться?"

    h9 "Я попала в…"

    n "Моя кукла! Где моя кукла?!"

    vv "Нэлли, прояви терпение! Что за несносный ребенок…"
    vv "И всё же мы рады, что вы до нас добрались."
    vv "А теперь, пожалуйста, вручите нам нашу посылку."

    show doll_1:
        zoom 0.25
        xpos 485 ypos 375
    with Dissolve(1)

    vv "Боже, что случилось с куклой?"

    n "Мама! Она вся порванная!"

    h9 "Мне очень жаль. Когда я ехала к вам, то попала в аварию."
    h9 "Сейчас очень сильное движение на улице, ещё и задымление…"

    vv "Простите, как вас зовут?"

    h9 "Мэллори."

    vv "Понимаете, Мэллори, у моей дочери лихорадка."
    vv_long  "Госпожа Амелинда уверила меня, что запах трав и специального порошка в этой кукле помогут сбить ее температуру…"

    h9 "Мне, правда, очень жаль. Но вы ещё можете зашить эту куклу."

    n "Мамочка, у нее из животика все вылетело!"

    vv "Я не уверена, что теперь есть в этом смысл…"
    vv "Нэлли так ждала эту куклу."

    menu:
        "Так или иначе, кукла у вас. Вы должны заплатить мне за доставку!":
            vv_long "Наглая девчонка. Тебе самой-то не стыдно? Вместо куклы ты принесла больному ребенку кусок рваного тряпья!"
            h9_long "Я попала в аварию, пока ехала к вам! И, несмотря на это, доставила куклу в срок!"
            pause 1.0
            vv "…На чаевые не надейся."
            $ Myo_value += 1
            $ money_value += 5
        "Оставьте деньги за доставку себе как компенсацию ущерба.":
            vv "Мэллори…"
            vv "Ты серьезно? Ведь тебе нелегко пришлось, как ты сама говоришь."
            h9 "Я найду ещё способ заработать. Главное, снова не попасть в аварию."
            h9 "Ведь из всех возможных неприятностей…"
            vv "…произойдёт именно та, ущерб от которой больше."
            vv "Так говорил мой муж. Береги себя, Мэллори."

    hide doll_1
    with dissolve

    pause 1.0

    hide gg_def
    with moveoutleft

    vv "Не плачь, Нэлли. Я накоплю денег и куплю тебе новую куклу."
    n "Мамочка.."
    vv "Что, солнышко?"
    n "Я больше не хочу быть курьером."

    pause 1.0

    scene black
    with dissolve

    $ map_info = ("9-10", "chapter_10")
    jump map

label chapter_9s1:

    show gg_def:
        zoom 0.2
        xpos 60 ypos 360
    with moveinleft

    h9 "Добрый день!"
    h9 "У меня посылка для маленькой Нелли."

    vv "Мы вас давно ждём!"

    h9 "Летела на максимальном пару."

    n "Моя кукла! Где моя кукла!"

    vv "Нэлли, прояви терпение! Что за несносный ребёнок.…"
    vv "И всё же мы рады, что вы до нас добрались."
    vv "А теперь, пожалуйста, вручите нам нашу посылку."

    show doll_2:
        alpha 0
        zoom 0.25
        xpos 485 ypos 375
        linear 1 alpha 1
        parallel:
            ease 1.0 xpos 1320
        parallel:
            ease 1.0 ypos 545
    pause 2.0
    show doll_2:
        alpha 1 zoom 0.25 xpos 1320 ypos 545

    n "Какая красивая…"
    n "Мама! От куклы плохо\nпахнет!"

    h9_long "Так и должно быть, Нэлли. Внутри этой куклы целебные травы и волшебный порошок."

    n "Волшебный?"

    h9_long "Да. Этот порошок поможет тебе выздороветь. Его передала тебе госпожа Амелинда."

    n "Мама, а эта кукла что, волшебная, получается?"

    vv "Скорее лечебная, милая."
    pause 1.0
    vv "Спасибо вам за доставку. Возьмите эти деньги. Вы их заработали."
    $ Myo_value += 2
    $ money_value += 10
    h9 "Я делаю это ради котика."

    vv "Уверена, вы заботливая хозяйка."

    
    pause 2.0

    h9 "Спасибо вам. Но мне пора бежать."
    h9 "Скорейшего выздоровления, малышка Нэлли. Всего хорошего!"

    n "До свидания, тётя курьер!"

    vv "Будьте внимательны на дорогах."

    hide gg_def
    with moveoutleft

    pause 1.0

    $ map_info = ("9-10", "chapter_10")

    jump map
